IDENTIFICATION DIVISION.
PROGRAM-ID. HTTPSERVER.

DATA DIVISION.

WORKING-STORAGE SECTION.

01  server                   TYPE CBL_OC_HTTP_SERVER.

PROCEDURE DIVISION.

    SET server TO NEW CBL_OC_HTTP_SERVER
    CALL "Start" OF server
        USING 8000
    .

END PROGRAM HTTPSERVER.
